[
  {
    "path": "posts/2021-03-20-why-the-dunning-krueger-effect-is-probably-not-real/",
    "title": "Why the Dunning-Krueger Effect is Probably Not Real",
    "description": "Explaining cut-off effects through examples.",
    "author": [
      {
        "name": "Jannik Buhr",
        "url": "https://jmbuhr.de/"
      }
    ],
    "date": "2021-07-11",
    "categories": [],
    "contents": "\n\n\nShow code\n\nlibrary(tidyverse)\n\ntheme_set(theme_minimal())\n\nin_range <- function(x, lower, upper) {\n  case_when(\n      x > upper ~ upper,\n      x < lower ~ lower,\n      TRUE      ~ x\n    )\n}\n\nn = 10000\nuncertainty = 0.5\n\nsim <- crossing(\n  participant = 1:n\n) %>% \n  mutate(\n    ability = rnorm(n(), 0.5, sd = 0.20),\n    actual = ability %>% in_range(0, 1),\n    perceived = (actual + rnorm(n(), 0, uncertainty)) %>% in_range(0, 1)\n  )\n\n\nsim_quantiles <- sim %>% \n  summarise(\n    quantile_breaks = quantile(actual),\n    quantile = names(quantile_breaks),\n    percieved_quantile_breaks = quantile(perceived),\n    percieved_quantile = names(percieved_quantile_breaks)\n  )\n\nsim <- sim %>% \n  mutate(\n    actual_q = cut(actual,\n                   breaks = sim_quantiles$quantile_breaks,\n                   labels = sim_quantiles$quantile[-1],\n                   include.lowest = TRUE),\n    perceived_q = cut(perceived,\n                      breaks = sim_quantiles$percieved_quantile_breaks,\n                      labels = sim_quantiles$percieved_quantile[-1],\n                      include.lowest = TRUE)\n  )\n\nsim_q_summary <- sim %>% \n  group_by(actual_q) %>%\n  summarise(across(c(actual, perceived),\n                   mean)) %>% \n  mutate(quartile_mean = actual) %>% \n  pivot_longer(c(actual, perceived))\n\n\n\nThe Dunning-Krueger Effect is Probably Not Real\nI recently came across this article by Jonathan Jarry (“The Dunning-Kruger Effect Is Probably Not Real” n.d.).\nI am not going to try and steal his thunder, so please do go ahead and read the article. It is well written, thoroughly researched and presents a valid point. Everything points towards the Dunning-Krueger effect being largely just an artifact of the way the original authors analyzed their data. Where I felt the article was lacking is in providing the somewhat statistical explanation of why this happens. This is why I settled on the current title of this post. In the following I am going to explain from basic principles why the results that Dunning and Krueger got in their experiments can largely be explained without any effect being present. Of course I am going to do so using the statistical programming language R and if you want to try out the code yourself feel free to click on the little GitHub icon in the top right corner to get sent to the source. You will find this article in the _posts folder. Or use the little + buttons to expand code sections.\nThe Evidence is Mounting\nLike the author of the article, I wanted the effect to be real. It just sounded to logical not to be real. After all, even the title of the original paper makes intuitive sense: “Unskilled and Unaware. How Difficulties in Recognizing One’s Own Incompetence Lead to Inflated Self-Assessments” (Kruger and Dunning 1999). And it feels so right that the skills required for an accurate self-assessment would be linked to the skills required for the actual task. Now, this is not completely wrong. Later studies also found that experts are better at predicting their scores than lesser skilled participants (and so are women compared to men, by the way) (Nuhfer et al. 2017). But what they didn’t find was the directionality claimed by Dunning and Krueger, where lesser skilled participants are supposedly more likely to be overconfident while higher skilled participants tended to rather underestimate their skills. Let’s dive into some numbers to see, how this misconception arises.\nDisecting a Dunning-Krueger Plot\n\n\nShow code\n\nsim_q_summary %>% \n  ggplot(aes(actual_q, value, lty = name, shape = name, group = name)) +\n  geom_point(data = sim_q_summary, color = \"black\", size = 2) +\n  geom_line(data = sim_q_summary, color = \"black\", show.legend = FALSE) +\n  scale_shape_manual(values = c(16, 15)) +\n  scale_y_continuous(limits = c(0,1)) +\n  labs(x = \"quantile\",\n       y = \"score\",\n       shape = \"type of score\")\n\n\n\n\nThis is what most plots in the original paper by Dunning and Krueger look like. And it looks very convincing at first glance. The dots representing the actual scores of participants in a test are lower than the scores that participants estimated (squares) in the case of lower-scoring participants and the effect is reversed for higher-scoring participants. But what is actually shown here?\nWhat are Quantiles?\nFirstly, we must note that these 8 dots are summaries of many dots. And I always tell my students to be extra careful when someone only shows summaries and not the raw data behind those summaries. But what kind of summaries are we dealing with here? Dunning and Krueger hat a total of 87 participants, which where all psychology undergraduate students (We can talk about this selection bias another time, because we have a bigger problem at hand). The original x-axis read “Bottom Quartile, 2nd Quartile, 3rd Quartile and Top Quartile,” which I replaced with percentages. I did so, because these so called quartiles are special cases of so called quantiles. And we are going to explore what those are now. There might already be one such quantile that you are familiar with: The median.\n\nThe median is the datapoint where half of all the other values are lower and the other half is higher.\n\nGenerally, quantiles are any number of points that divide your datapoints into equally sized pieces. If you get 4 of those pieces, they are called quartiles. The first quartile is the point such that one quarter, or 25% of datapoints, are smaller than that point. By that logic, the median can have many names. It could also be called the 2nd quartile or the 50th percentile. I chose the general notion of quantile and used percentages as labels because the problem we are about to uncover is a general problem, not just a problem of quartiles. As we will later show, it will also appear if we use infinitely small pieces to divide our data with, so it is not a “binning problem” as I initially thought when I read that they summarized within the quartiles. Speaking of summarizing, let’s look into what happened to our raw datapoints.\nSimulating the Data\nNow, Dunning and Krueger only had 87 participants. But we are on a computer and we can simulate as many participants as we want, so let’s start with 10’000! This will also help to show that the problem is intrinsic to the way the data is summarized and not just a sample-size issue. We will talk about the raw data and then make our way to the plot above.\nImagine we have all 10’000 participants take part in a test. The lowest score they can achieve is 0 and the highest is 1. Let us also assume that all the participants have some sort of skill, which we are trying to measure with the test. It is important to note here that this makes our test just a proxy for this skill. And it is a limited proxy. Even if we leave aside that the performance of any individual can vary from day to day (we are sort of making up for that by testing a lot of people), there is still a fundamental limit in our scoring. The lowest score you can get is 0, even though among those that will score a 0, some will be higher and some lower skilled than their peers, and still they all have the same score. The same goes for a score of 1. If we are the highest skilled participant, we would get a score of 1, but other participants that are less skilled would also get a 1. So the actual skill-distribution might be wider than our score distribution between 0 and 1.\n\n\nShow code\n\nsim %>% \n  select(skill = ability, score = actual) %>% \n  pivot_longer(everything()) %>% \n  ggplot(aes(value, fill = name, color = name)) +\n  geom_histogram(position = \"identity\", alpha = 0.4) +\n  labs(fill = \"\") +\n  guides(color = \"none\")\n\n\n\n\nThis cutoff means that we are getting more 0s and 1s than the other scores. At this point this might not actually be a problem and it really depends on how much the skills and achievable scores are spread out, but it will be a much bigger problem once we ask participants for their self assessment. Because self assessments can vary a lot.\nImagine this: For every score that a participant gets, it is equally likely that he or she has a higher or lower self-assessment:\n\n\nShow code\n\nsim %>% \n  mutate(\n    perceived = actual + rnorm(n(), 0, uncertainty / 5)\n  ) %>% \n  ggplot(aes(actual, perceived)) +\n  geom_hline(yintercept = c(0, 1), color = \"darkred\") +\n  geom_point() \n\n\n\n\n“Hang on!” you say: “there are some illegal scores in there!” And you are correct. Because we can get scores lower than 0 and lower than 1, the self-assessment can’t have those as well. After all, who would think that they got 120% in a test? Or a score of -0.3 where 0 is the lowest possible score? And this is the crux.\nA Cutoff-Effect\nThose participants will be forced to apply a cutoff to their self-assessment so that it lies within 0 and 1. Crucially, when participants are equally likely to over or underestimate their skill, those whose actual skill is low are more likely to run into the cutoff on the lower end. Those whose actual skill is high will run into the cutoff on the upper end more often. This means that on the lower end of the skill spectrum, we are getting more self assessed scores that are 0, but would have been lower than that (e.g. -0.3) and on the other end we are getting more self assessed scores that are 1 but could have been higher than that if the scales allowed it. When we now summarize those values by first separating them into equally sized slices (the quantiles) and then calculating the mean (= the average) of all the points within those slices, something interesting happens.\nImagine rolling a die and calculating the average.\n\n\nShow code\n\ntibble(\n  x = sample(1:6, 10000, replace = TRUE)\n) %>% \n  ggplot(aes(factor(x))) +\n  geom_bar(width = 0.4) +\n  labs(x = \"Number rolled\") +\n  geom_vline(xintercept = 3.5, color = \"darkred\")\n\n\n\n\nThe average of the numbers rolled will be close to 3.5. Now, what would happen, when every time you rolled a 1, you would write down 2 instead? Of course, the average would increase!\n\n\nShow code\n\ntibble(\n  x = sample(1:6, 10000, replace = TRUE)\n) %>% \n  mutate(x = ifelse(x < 2, 2, x)) %>% \n  ggplot(aes(factor(x))) +\n  geom_bar(width = 0.4) +\n  labs(x = \"Number rolled\") +\n  geom_vline(xintercept = 3.5, color = \"darkred\")\n\n\n\n\nAnd the same happens on both ends of the skill-assessments and scores, just in opposite directions. So let’s look at the raw numbers behind the plot I initially showed you.\nBehind the Curtain\nThe dark points and lines are the familiar averages just like in the original Dunning and Krueger plot. But now we can also inspect the individual scores and self-assessed scores. The individual points are colored by the quartile to which they belong.\n\n\nShow code\n\nsim %>% \n  ggplot(aes(actual, perceived, color = actual_q)) +\n  geom_point(alpha = 0.6) +\n  geom_point(data = sim_q_summary, aes(quartile_mean, value,\n                                       shape = name,\n                                       group = name), color = \"black\", size = 2) +\n  geom_line(data = sim_q_summary, aes(quartile_mean, value,\n                                       group = name), color = \"black\") +\n  scale_shape_manual(values = c(15, 16)) +\n  scale_y_continuous(limits = c(0,1)) +\n  labs(shape = \"\",\n       color = \"quantile\",\n       x = \"actual score\",\n       y = \"perceived score\")\n\n\n\n\nNow we see the cut-off in full effect. And it doesn’t even matter that we used quartiles, any number of quantiles would have done. The size of this effect only depends on the spread of the self-assessments, which is usually quite large.\nTowards the Continuum\nFor example, if you use 10 quantiles, we can still observe the effect.\n\n\nShow code\n\nsim_quantiles <- sim %>% \n  summarise(\n    quantile_breaks = quantile(actual, probs = seq(0, 1, 0.1)),\n    quantile = names(quantile_breaks)\n  )\n\nsim <- sim %>% \n  mutate(\n    actual_q = cut(actual,\n                   breaks = sim_quantiles$quantile_breaks,\n                   labels = sim_quantiles$quantile[-1],\n                   include.lowest = TRUE)\n  )\n\nsim_q_summary <- sim %>% \n  group_by(actual_q) %>%\n  summarise(across(c(actual, perceived),\n                   mean)) %>% \n  mutate(quartile_mean = actual) %>% \n  pivot_longer(c(actual, perceived))\n\nsim %>% \n  ggplot(aes(actual, perceived, color = actual_q)) +\n  geom_segment(data = sim_quantiles, aes(x = quantile_breaks,\n                                         xend = quantile_breaks,\n                                         y = 0,\n                                         yend = 1),\n               inherit.aes = FALSE) +\n  geom_point(alpha = 0.4) +\n  geom_line(data = sim_q_summary, aes(quartile_mean, value,\n                                       group = name), color = \"black\") +\n  geom_point(data = sim_q_summary, aes(quartile_mean, value,\n                                       shape = name,\n                                       group = name),\n             color = \"white\",\n             fill = \"black\",\n             size = 3\n             ) +\n  scale_shape_manual(values = c(21, 22)) +\n  scale_color_viridis_d(end = 0.7) +\n  labs(\n    x = \"actual score\",\n    y = \"percieved score\",\n    caption = \"Color = percentile\"\n  ) +\n  guides(color = \"none\")\n\n\n\n\nThere is one more thing to take care of. In my plots I used the actual and the perceived scores on the axis, whereas Dunning and Krueger actually used quantiles on both axis. We can show that the effect is independent of how many quantiles we take and still holds up if we use quantiles for the perceived scores by transitioning to the most general notion of what a quantile does. A rank captures the essential idea behind a quantile, without having to decide on the number of quantiles. The rank of a value is just the number of values that are below that value. For example, the average house mouse has a body length of about 8 centimeters, the average human male is 171 and the average human female is 159 cm tall while an average giraffe is 500 cm tall. The rank of those values is the order of those vales:\n\n\nShow code\n\nx = c(8, 171, 159, 500)\nnames(x) = c(\"mouse\", \"human male\", \"human female\", \"giraffe\")\nrank(x)\n\n\n       mouse   human male human female      giraffe \n           1            3            2            4 \n\nIf we use this rank procedure to transform the actual and perceived scores, this is what we end up with:\n\n\nShow code\n\nsim_rank_mean <- sim %>% \n  mutate(\n    actual_rank = rank(actual),\n    perceived_rank = rank(perceived)\n  ) %>% \n  group_by(actual_q) %>% \n  summarise(\n    actual_rank =  mean(actual_rank),\n    perceived_rank = mean(perceived_rank)\n  ) %>% \n  mutate(quartile_rank = actual_rank) %>% \n  pivot_longer(c(perceived_rank, actual_rank))\n\nsim_quantiles <- sim %>% \n  summarise(\n    quantile_breaks = quantile(rank(actual), probs = seq(0, 1, 0.1)),\n    quantile = names(quantile_breaks)\n  )\n\nsim %>% \n  mutate(\n    actual_rank = rank(actual),\n    perceived_rank = rank(perceived)\n  ) %>% \n  ggplot(aes(actual_rank, perceived_rank, fill = actual_q)) +\n  geom_point(aes(color = actual_q), alpha = 0.4) +\n  geom_segment(data = sim_quantiles, aes(x = quantile_breaks,\n                                         xend = quantile_breaks,\n                                         y = 0,\n                                         yend = Inf),\n               inherit.aes = FALSE) +\n  geom_line(data = sim_rank_mean, aes(quartile_rank, value,\n                                       group = name), color = \"black\") +\n  geom_point(data = sim_rank_mean, aes(quartile_rank, value,\n                                       shape = name,\n                                       group = name),\n             color = \"white\", size = 3, fill = \"black\") +\n  scale_shape_manual(values = c(21, 22)) +\n  scale_color_viridis_d(end = 0.7) +\n  labs(shape = \"\",\n       caption = \"Color = percentile\",\n       x = \"actual rank\",\n       y = \"perceived rank\") +\n  guides(color = \"none\", fill = \"none\")\n\n\n\n\n\n\n\nKruger, J., and D. Dunning. 1999. “Unskilled and Unaware of It: How Difficulties in Recognizing One’s Own Incompetence Lead to Inflated Self-Assessments.” Journal of Personality and Social Psychology 77 (6): 1121–34. https://doi.org/10.1037//0022-3514.77.6.1121.\n\n\nNuhfer, Edward, Steven Fleisher, Christopher Cogan, Karl Wirth, and Eric Gaze. 2017. “How Random Noise and a Graphical Convention Subverted Behavioral Scientists’ Explanations of Self-Assessment Data: Numeracy Underlies Better Alternatives.” Numeracy 10 (1). https://doi.org/http://dx.doi.org/10.5038/1936-4660.10.1.4.\n\n\n“The Dunning-Kruger Effect Is Probably Not Real.” n.d. Office for Science and Society. Accessed March 25, 2021. https://www.mcgill.ca/oss/article/critical-thinking/dunning-kruger-effect-probably-not-real.\n\n\n\n\n",
    "preview": "posts/2021-03-20-why-the-dunning-krueger-effect-is-probably-not-real/why-the-dunning-krueger-effect-is-probably-not-real_files/figure-html5/unnamed-chunk-2-1.png",
    "last_modified": "2021-07-11T13:25:34+02:00",
    "input_file": {},
    "preview_width": 1248,
    "preview_height": 768
  },
  {
    "path": "posts/2021-03-14-making-a-darkmode-for-your-distill-site/",
    "title": "Making a Darkmode for your distill site",
    "description": "We build a darkmode for our distill site using css and a bit of java script.",
    "author": [
      {
        "name": "Jannik Buhr",
        "url": {}
      }
    ],
    "date": "2021-03-14",
    "categories": [],
    "contents": "\nJoin the Dark Side!\n… we have cookies.\nFrom: knowyourmemeThere are many motivations to adding a dark mode to your site. I just like it, when things look consistent. So I also want my site to reflect that. But because at the same time I am also not very good at making things look consistent, which is why I mostly outsource design choices as much as I can. Here, for example, this means that I took the color values for the dark theme from the amazing nord color palette.\nBut let’s get into the practical side! How do we add a dark theme to complement our light theme to our distill site?\nAdding the button, css and java script\nFirst, we want a button that a user can click on to change the theme. I opted for the adjust button from Font Awesome. There is not much to do here, because those are already available in distill. Open up your _site.yml file and add an icon to the navbar:\nnavbar:\n  right:\n    - icon: fas fa-adjust\nWhile we are in this file, let’s also add the includes for the html file which will make the button work:\noutput:\n  distill::distill_article:\n    includes:\n      after_body: \"_after_body.html\"\n\nNote: I am omitting all the other things in our .yml file here and only show, what is being added. But I include the indentation-levels above the thing being added to show where to put it.\n\nThis is what _after_body.html looks like:\n<script>\nconst darkmodeToggle = document.getElementsByClassName(\"fas fa-adjust\")[0];\nlet theme = localStorage.getItem(\"theme\");\n\nif (!theme) {\n  if (window.matchMedia(\"(prefers-color-scheme: dark)\").matches ) {\n    theme = \"dark\";\n  } else {\n    theme = \"light\";\n  }\n}\nsetTheme();\n\nfunction switchTheme() {\n  if (theme === \"light\") {\n    theme = \"dark\";\n  } else {\n    theme = \"light\";\n  }\n  localStorage.setItem(\"theme\", theme);\n  setTheme();\n  console.log(theme);\n}\n\nfunction setTheme() {\n  if (theme === \"dark\") {\n    document.body.classList.add('darkmode');\n  } else {\n    document.body.classList.remove('darkmode');\n  }\n}\n\ndarkmodeToggle.addEventListener('click', switchTheme)\n<\/script>\nUnfortunately, the only way I found to refer to the darkmode toggle icon in the navbar was by class name. I could not find a way to give it an id from _site.yml. However, this should be fine because the navbar is usually the first thing on the page and the script refers to the first element of class fas fa-adjust that it can find. It is also important to have this script be included after the body, so that the rest of the site can load first before the script tries to find the button. Typically you would do this using a script file and sourcing it with the option defer, but sourcing a script file doesn’t work here due to the way distill changes file-path’s between top-level sites and posts. This is why the complete script is in the html here. The script adds a class .darkmode to the html body (and removes it when toggled off). This choice is first based on browser preferences and then saved to local storage.\nThe last thing to modify is our theme.css to make use of this .darkmode class. For each thing we want to change about our theme when it get’s dark, we take the corresponding class and the darkmode class and add our styling e.g.\n.darkmode d-article,\n.darkmode d-appendix,\n.darkmode body {\n  background-color: black;\n  color: white;\n}\nYou can have a look at my theme.css file for inspiration on what thing you need to change (though the css could be way cleaner): https://github.com/jmbuhr/jmbuhr.github.io/blob/master/theme.css\n\n\n\n",
    "preview": "posts/2021-03-14-making-a-darkmode-for-your-distill-site/images/cookies.png",
    "last_modified": "2021-03-19T11:28:27+01:00",
    "input_file": {},
    "preview_width": 350,
    "preview_height": 263
  },
  {
    "path": "posts/2020-02-15-demonstration/",
    "title": "demonstration",
    "description": "A short description of the post.",
    "author": [],
    "date": "2020-11-26",
    "categories": [],
    "contents": "\nTests\nPreview Image\n\n\nplt <- ggplot2::ggplot(ggplot2::mpg, ggplot2::aes(displ, cty)) +\n  ggplot2::geom_point()\nplt\n\n\n\n\nDetails\n\n\nprint(\"hello world\")\n\n\n[1] \"hello world\"\n\np5\nw and s move the left paddle, o and l move the right paddle.\n\n\n\nXaringan Slides\n\n\nknitr::include_url(\"slides1.html\")\n\n\n\n\n\nDT\n\n\nDT::datatable(head(iris))\n\n\n\n{\"x\":{\"filter\":\"none\",\"data\":[[\"1\",\"2\",\"3\",\"4\",\"5\",\"6\"],[5.1,4.9,4.7,4.6,5,5.4],[3.5,3,3.2,3.1,3.6,3.9],[1.4,1.4,1.3,1.5,1.4,1.7],[0.2,0.2,0.2,0.2,0.2,0.4],[\"setosa\",\"setosa\",\"setosa\",\"setosa\",\"setosa\",\"setosa\"]],\"container\":\"<table class=\\\"display\\\">\\n  <thead>\\n    <tr>\\n      <th> <\\/th>\\n      <th>Sepal.Length<\\/th>\\n      <th>Sepal.Width<\\/th>\\n      <th>Petal.Length<\\/th>\\n      <th>Petal.Width<\\/th>\\n      <th>Species<\\/th>\\n    <\\/tr>\\n  <\\/thead>\\n<\\/table>\",\"options\":{\"columnDefs\":[{\"className\":\"dt-right\",\"targets\":[1,2,3,4]},{\"orderable\":false,\"targets\":0}],\"order\":[],\"autoWidth\":false,\"orderClasses\":false}},\"evals\":[],\"jsHooks\":[]}\nPlotly\n\n\nprint(\"test\")\n\n\n[1] \"test\"\n\nplt <- ggplot2::ggplot(ggplot2::mpg, ggplot2::aes(displ, cty)) +\n  ggplot2::geom_point()\nplotly::ggplotly(plt)\n\n\n\n{\"x\":{\"data\":[{\"x\":[1.8,1.8,2,2,2.8,2.8,3.1,1.8,1.8,2,2,2.8,2.8,3.1,3.1,2.8,3.1,4.2,5.3,5.3,5.3,5.7,6,5.7,5.7,6.2,6.2,7,5.3,5.3,5.7,6.5,2.4,2.4,3.1,3.5,3.6,2.4,3,3.3,3.3,3.3,3.3,3.3,3.8,3.8,3.8,4,3.7,3.7,3.9,3.9,4.7,4.7,4.7,5.2,5.2,3.9,4.7,4.7,4.7,5.2,5.7,5.9,4.7,4.7,4.7,4.7,4.7,4.7,5.2,5.2,5.7,5.9,4.6,5.4,5.4,4,4,4,4,4.6,5,4.2,4.2,4.6,4.6,4.6,5.4,5.4,3.8,3.8,4,4,4.6,4.6,4.6,4.6,5.4,1.6,1.6,1.6,1.6,1.6,1.8,1.8,1.8,2,2.4,2.4,2.4,2.4,2.5,2.5,3.3,2,2,2,2,2.7,2.7,2.7,3,3.7,4,4.7,4.7,4.7,5.7,6.1,4,4.2,4.4,4.6,5.4,5.4,5.4,4,4,4.6,5,2.4,2.4,2.5,2.5,3.5,3.5,3,3,3.5,3.3,3.3,4,5.6,3.1,3.8,3.8,3.8,5.3,2.5,2.5,2.5,2.5,2.5,2.5,2.2,2.2,2.5,2.5,2.5,2.5,2.5,2.5,2.7,2.7,3.4,3.4,4,4.7,2.2,2.2,2.4,2.4,3,3,3.5,2.2,2.2,2.4,2.4,3,3,3.3,1.8,1.8,1.8,1.8,1.8,4.7,5.7,2.7,2.7,2.7,3.4,3.4,4,4,2,2,2,2,2.8,1.9,2,2,2,2,2.5,2.5,2.8,2.8,1.9,1.9,2,2,2.5,2.5,1.8,1.8,2,2,2.8,2.8,3.6],\"y\":[18,21,20,21,16,18,18,18,16,20,19,15,17,17,15,15,17,16,14,11,14,13,12,16,15,16,15,15,14,11,11,14,19,22,18,18,17,18,17,16,16,17,17,11,15,15,16,16,15,14,13,14,14,14,9,11,11,13,13,9,13,11,13,11,12,9,13,13,12,9,11,11,13,11,11,11,12,14,15,14,13,13,13,14,14,13,13,13,11,13,18,18,17,16,15,15,15,15,14,28,24,25,23,24,26,25,24,21,18,18,21,21,18,18,19,19,19,20,20,17,16,17,17,15,15,14,9,14,13,11,11,12,12,11,11,11,12,14,13,13,13,21,19,23,23,19,19,18,19,19,14,15,14,12,18,16,17,18,16,18,18,20,19,20,18,21,19,19,19,20,20,19,20,15,16,15,15,16,14,21,21,21,21,18,18,19,21,21,21,22,18,18,18,24,24,26,28,26,11,13,15,16,17,15,15,15,16,21,19,21,22,17,33,21,19,22,21,21,21,16,17,35,29,21,19,20,20,21,18,19,21,16,18,17],\"text\":[\"displ: 1.8<br />cty: 18\",\"displ: 1.8<br />cty: 21\",\"displ: 2.0<br />cty: 20\",\"displ: 2.0<br />cty: 21\",\"displ: 2.8<br />cty: 16\",\"displ: 2.8<br />cty: 18\",\"displ: 3.1<br />cty: 18\",\"displ: 1.8<br />cty: 18\",\"displ: 1.8<br />cty: 16\",\"displ: 2.0<br />cty: 20\",\"displ: 2.0<br />cty: 19\",\"displ: 2.8<br />cty: 15\",\"displ: 2.8<br />cty: 17\",\"displ: 3.1<br />cty: 17\",\"displ: 3.1<br />cty: 15\",\"displ: 2.8<br />cty: 15\",\"displ: 3.1<br />cty: 17\",\"displ: 4.2<br />cty: 16\",\"displ: 5.3<br />cty: 14\",\"displ: 5.3<br />cty: 11\",\"displ: 5.3<br />cty: 14\",\"displ: 5.7<br />cty: 13\",\"displ: 6.0<br />cty: 12\",\"displ: 5.7<br />cty: 16\",\"displ: 5.7<br />cty: 15\",\"displ: 6.2<br />cty: 16\",\"displ: 6.2<br />cty: 15\",\"displ: 7.0<br />cty: 15\",\"displ: 5.3<br />cty: 14\",\"displ: 5.3<br />cty: 11\",\"displ: 5.7<br />cty: 11\",\"displ: 6.5<br />cty: 14\",\"displ: 2.4<br />cty: 19\",\"displ: 2.4<br />cty: 22\",\"displ: 3.1<br />cty: 18\",\"displ: 3.5<br />cty: 18\",\"displ: 3.6<br />cty: 17\",\"displ: 2.4<br />cty: 18\",\"displ: 3.0<br />cty: 17\",\"displ: 3.3<br />cty: 16\",\"displ: 3.3<br />cty: 16\",\"displ: 3.3<br />cty: 17\",\"displ: 3.3<br />cty: 17\",\"displ: 3.3<br />cty: 11\",\"displ: 3.8<br />cty: 15\",\"displ: 3.8<br />cty: 15\",\"displ: 3.8<br />cty: 16\",\"displ: 4.0<br />cty: 16\",\"displ: 3.7<br />cty: 15\",\"displ: 3.7<br />cty: 14\",\"displ: 3.9<br />cty: 13\",\"displ: 3.9<br />cty: 14\",\"displ: 4.7<br />cty: 14\",\"displ: 4.7<br />cty: 14\",\"displ: 4.7<br />cty:  9\",\"displ: 5.2<br />cty: 11\",\"displ: 5.2<br />cty: 11\",\"displ: 3.9<br />cty: 13\",\"displ: 4.7<br />cty: 13\",\"displ: 4.7<br />cty:  9\",\"displ: 4.7<br />cty: 13\",\"displ: 5.2<br />cty: 11\",\"displ: 5.7<br />cty: 13\",\"displ: 5.9<br />cty: 11\",\"displ: 4.7<br />cty: 12\",\"displ: 4.7<br />cty:  9\",\"displ: 4.7<br />cty: 13\",\"displ: 4.7<br />cty: 13\",\"displ: 4.7<br />cty: 12\",\"displ: 4.7<br />cty:  9\",\"displ: 5.2<br />cty: 11\",\"displ: 5.2<br />cty: 11\",\"displ: 5.7<br />cty: 13\",\"displ: 5.9<br />cty: 11\",\"displ: 4.6<br />cty: 11\",\"displ: 5.4<br />cty: 11\",\"displ: 5.4<br />cty: 12\",\"displ: 4.0<br />cty: 14\",\"displ: 4.0<br />cty: 15\",\"displ: 4.0<br />cty: 14\",\"displ: 4.0<br />cty: 13\",\"displ: 4.6<br />cty: 13\",\"displ: 5.0<br />cty: 13\",\"displ: 4.2<br />cty: 14\",\"displ: 4.2<br />cty: 14\",\"displ: 4.6<br />cty: 13\",\"displ: 4.6<br />cty: 13\",\"displ: 4.6<br />cty: 13\",\"displ: 5.4<br />cty: 11\",\"displ: 5.4<br />cty: 13\",\"displ: 3.8<br />cty: 18\",\"displ: 3.8<br />cty: 18\",\"displ: 4.0<br />cty: 17\",\"displ: 4.0<br />cty: 16\",\"displ: 4.6<br />cty: 15\",\"displ: 4.6<br />cty: 15\",\"displ: 4.6<br />cty: 15\",\"displ: 4.6<br />cty: 15\",\"displ: 5.4<br />cty: 14\",\"displ: 1.6<br />cty: 28\",\"displ: 1.6<br />cty: 24\",\"displ: 1.6<br />cty: 25\",\"displ: 1.6<br />cty: 23\",\"displ: 1.6<br />cty: 24\",\"displ: 1.8<br />cty: 26\",\"displ: 1.8<br />cty: 25\",\"displ: 1.8<br />cty: 24\",\"displ: 2.0<br />cty: 21\",\"displ: 2.4<br />cty: 18\",\"displ: 2.4<br />cty: 18\",\"displ: 2.4<br />cty: 21\",\"displ: 2.4<br />cty: 21\",\"displ: 2.5<br />cty: 18\",\"displ: 2.5<br />cty: 18\",\"displ: 3.3<br />cty: 19\",\"displ: 2.0<br />cty: 19\",\"displ: 2.0<br />cty: 19\",\"displ: 2.0<br />cty: 20\",\"displ: 2.0<br />cty: 20\",\"displ: 2.7<br />cty: 17\",\"displ: 2.7<br />cty: 16\",\"displ: 2.7<br />cty: 17\",\"displ: 3.0<br />cty: 17\",\"displ: 3.7<br />cty: 15\",\"displ: 4.0<br />cty: 15\",\"displ: 4.7<br />cty: 14\",\"displ: 4.7<br />cty:  9\",\"displ: 4.7<br />cty: 14\",\"displ: 5.7<br />cty: 13\",\"displ: 6.1<br />cty: 11\",\"displ: 4.0<br />cty: 11\",\"displ: 4.2<br />cty: 12\",\"displ: 4.4<br />cty: 12\",\"displ: 4.6<br />cty: 11\",\"displ: 5.4<br />cty: 11\",\"displ: 5.4<br />cty: 11\",\"displ: 5.4<br />cty: 12\",\"displ: 4.0<br />cty: 14\",\"displ: 4.0<br />cty: 13\",\"displ: 4.6<br />cty: 13\",\"displ: 5.0<br />cty: 13\",\"displ: 2.4<br />cty: 21\",\"displ: 2.4<br />cty: 19\",\"displ: 2.5<br />cty: 23\",\"displ: 2.5<br />cty: 23\",\"displ: 3.5<br />cty: 19\",\"displ: 3.5<br />cty: 19\",\"displ: 3.0<br />cty: 18\",\"displ: 3.0<br />cty: 19\",\"displ: 3.5<br />cty: 19\",\"displ: 3.3<br />cty: 14\",\"displ: 3.3<br />cty: 15\",\"displ: 4.0<br />cty: 14\",\"displ: 5.6<br />cty: 12\",\"displ: 3.1<br />cty: 18\",\"displ: 3.8<br />cty: 16\",\"displ: 3.8<br />cty: 17\",\"displ: 3.8<br />cty: 18\",\"displ: 5.3<br />cty: 16\",\"displ: 2.5<br />cty: 18\",\"displ: 2.5<br />cty: 18\",\"displ: 2.5<br />cty: 20\",\"displ: 2.5<br />cty: 19\",\"displ: 2.5<br />cty: 20\",\"displ: 2.5<br />cty: 18\",\"displ: 2.2<br />cty: 21\",\"displ: 2.2<br />cty: 19\",\"displ: 2.5<br />cty: 19\",\"displ: 2.5<br />cty: 19\",\"displ: 2.5<br />cty: 20\",\"displ: 2.5<br />cty: 20\",\"displ: 2.5<br />cty: 19\",\"displ: 2.5<br />cty: 20\",\"displ: 2.7<br />cty: 15\",\"displ: 2.7<br />cty: 16\",\"displ: 3.4<br />cty: 15\",\"displ: 3.4<br />cty: 15\",\"displ: 4.0<br />cty: 16\",\"displ: 4.7<br />cty: 14\",\"displ: 2.2<br />cty: 21\",\"displ: 2.2<br />cty: 21\",\"displ: 2.4<br />cty: 21\",\"displ: 2.4<br />cty: 21\",\"displ: 3.0<br />cty: 18\",\"displ: 3.0<br />cty: 18\",\"displ: 3.5<br />cty: 19\",\"displ: 2.2<br />cty: 21\",\"displ: 2.2<br />cty: 21\",\"displ: 2.4<br />cty: 21\",\"displ: 2.4<br />cty: 22\",\"displ: 3.0<br />cty: 18\",\"displ: 3.0<br />cty: 18\",\"displ: 3.3<br />cty: 18\",\"displ: 1.8<br />cty: 24\",\"displ: 1.8<br />cty: 24\",\"displ: 1.8<br />cty: 26\",\"displ: 1.8<br />cty: 28\",\"displ: 1.8<br />cty: 26\",\"displ: 4.7<br />cty: 11\",\"displ: 5.7<br />cty: 13\",\"displ: 2.7<br />cty: 15\",\"displ: 2.7<br />cty: 16\",\"displ: 2.7<br />cty: 17\",\"displ: 3.4<br />cty: 15\",\"displ: 3.4<br />cty: 15\",\"displ: 4.0<br />cty: 15\",\"displ: 4.0<br />cty: 16\",\"displ: 2.0<br />cty: 21\",\"displ: 2.0<br />cty: 19\",\"displ: 2.0<br />cty: 21\",\"displ: 2.0<br />cty: 22\",\"displ: 2.8<br />cty: 17\",\"displ: 1.9<br />cty: 33\",\"displ: 2.0<br />cty: 21\",\"displ: 2.0<br />cty: 19\",\"displ: 2.0<br />cty: 22\",\"displ: 2.0<br />cty: 21\",\"displ: 2.5<br />cty: 21\",\"displ: 2.5<br />cty: 21\",\"displ: 2.8<br />cty: 16\",\"displ: 2.8<br />cty: 17\",\"displ: 1.9<br />cty: 35\",\"displ: 1.9<br />cty: 29\",\"displ: 2.0<br />cty: 21\",\"displ: 2.0<br />cty: 19\",\"displ: 2.5<br />cty: 20\",\"displ: 2.5<br />cty: 20\",\"displ: 1.8<br />cty: 21\",\"displ: 1.8<br />cty: 18\",\"displ: 2.0<br />cty: 19\",\"displ: 2.0<br />cty: 21\",\"displ: 2.8<br />cty: 16\",\"displ: 2.8<br />cty: 18\",\"displ: 3.6<br />cty: 17\"],\"type\":\"scatter\",\"mode\":\"markers\",\"marker\":{\"autocolorscale\":false,\"color\":\"rgba(0,0,0,1)\",\"opacity\":1,\"size\":5.66929133858268,\"symbol\":\"circle\",\"line\":{\"width\":1.88976377952756,\"color\":\"rgba(0,0,0,1)\"}},\"hoveron\":\"points\",\"showlegend\":false,\"xaxis\":\"x\",\"yaxis\":\"y\",\"hoverinfo\":\"text\",\"frame\":null}],\"layout\":{\"margin\":{\"t\":27.8721461187215,\"r\":7.30593607305936,\"b\":41.8264840182648,\"l\":37.2602739726027},\"plot_bgcolor\":\"rgba(235,235,235,1)\",\"paper_bgcolor\":\"rgba(255,255,255,1)\",\"font\":{\"color\":\"rgba(0,0,0,1)\",\"family\":\"\",\"size\":14.6118721461187},\"xaxis\":{\"domain\":[0,1],\"automargin\":true,\"type\":\"linear\",\"autorange\":false,\"range\":[1.33,7.27],\"tickmode\":\"array\",\"ticktext\":[\"2\",\"3\",\"4\",\"5\",\"6\",\"7\"],\"tickvals\":[2,3,4,5,6,7],\"categoryorder\":\"array\",\"categoryarray\":[\"2\",\"3\",\"4\",\"5\",\"6\",\"7\"],\"nticks\":null,\"ticks\":\"outside\",\"tickcolor\":\"rgba(51,51,51,1)\",\"ticklen\":3.65296803652968,\"tickwidth\":0.66417600664176,\"showticklabels\":true,\"tickfont\":{\"color\":\"rgba(77,77,77,1)\",\"family\":\"\",\"size\":11.689497716895},\"tickangle\":-0,\"showline\":false,\"linecolor\":null,\"linewidth\":0,\"showgrid\":true,\"gridcolor\":\"rgba(255,255,255,1)\",\"gridwidth\":0.66417600664176,\"zeroline\":false,\"anchor\":\"y\",\"title\":{\"text\":\"displ\",\"font\":{\"color\":\"rgba(0,0,0,1)\",\"family\":\"\",\"size\":14.6118721461187}},\"hoverformat\":\".2f\"},\"yaxis\":{\"domain\":[0,1],\"automargin\":true,\"type\":\"linear\",\"autorange\":false,\"range\":[7.7,36.3],\"tickmode\":\"array\",\"ticktext\":[\"10\",\"15\",\"20\",\"25\",\"30\",\"35\"],\"tickvals\":[10,15,20,25,30,35],\"categoryorder\":\"array\",\"categoryarray\":[\"10\",\"15\",\"20\",\"25\",\"30\",\"35\"],\"nticks\":null,\"ticks\":\"outside\",\"tickcolor\":\"rgba(51,51,51,1)\",\"ticklen\":3.65296803652968,\"tickwidth\":0.66417600664176,\"showticklabels\":true,\"tickfont\":{\"color\":\"rgba(77,77,77,1)\",\"family\":\"\",\"size\":11.689497716895},\"tickangle\":-0,\"showline\":false,\"linecolor\":null,\"linewidth\":0,\"showgrid\":true,\"gridcolor\":\"rgba(255,255,255,1)\",\"gridwidth\":0.66417600664176,\"zeroline\":false,\"anchor\":\"x\",\"title\":{\"text\":\"cty\",\"font\":{\"color\":\"rgba(0,0,0,1)\",\"family\":\"\",\"size\":14.6118721461187}},\"hoverformat\":\".2f\"},\"shapes\":[{\"type\":\"rect\",\"fillcolor\":null,\"line\":{\"color\":null,\"width\":0,\"linetype\":[]},\"yref\":\"paper\",\"xref\":\"paper\",\"x0\":0,\"x1\":1,\"y0\":0,\"y1\":1}],\"showlegend\":false,\"legend\":{\"bgcolor\":\"rgba(255,255,255,1)\",\"bordercolor\":\"transparent\",\"borderwidth\":1.88976377952756,\"font\":{\"color\":\"rgba(0,0,0,1)\",\"family\":\"\",\"size\":11.689497716895}},\"hovermode\":\"closest\",\"barmode\":\"relative\"},\"config\":{\"doubleClick\":\"reset\",\"showSendToCloud\":false},\"source\":\"A\",\"attrs\":{\"5bed3aeba3fb\":{\"x\":{},\"y\":{},\"type\":\"scatter\"}},\"cur_data\":\"5bed3aeba3fb\",\"visdat\":{\"5bed3aeba3fb\":[\"function (y) \",\"x\"]},\"highlight\":{\"on\":\"plotly_click\",\"persistent\":false,\"dynamic\":false,\"selectize\":false,\"opacityDim\":0.2,\"selected\":{\"opacity\":1},\"debounce\":0},\"shinyEvents\":[\"plotly_hover\",\"plotly_click\",\"plotly_selected\",\"plotly_relayout\",\"plotly_brushed\",\"plotly_brushing\",\"plotly_clickannotation\",\"plotly_doubleclick\",\"plotly_deselect\",\"plotly_afterplot\",\"plotly_sunburstclick\"],\"base_url\":\"https://plot.ly\"},\"evals\":[],\"jsHooks\":[]}\nHowever, while this options brings back plotly, it also disables math rendering for this document on the site.\nMath\n\\[sd = \\sqrt{\\frac{\\sum_{i=0}^{n}{(x_i-\\bar x)^2}}{(n-1)} }\\]\ndiagrammeR\n\n\nDiagrammeR::mermaid(\n\"\ngraph TB\nA-->B\nA-->C\nC-->E\nB-->D\nC-->D\nD-->F\nE-->F\n\")\n\n\n\n{\"x\":{\"diagram\":\"\\ngraph TB\\nA-->B\\nA-->C\\nC-->E\\nB-->D\\nC-->D\\nD-->F\\nE-->F\\n\"},\"evals\":[],\"jsHooks\":[]}\n\n\n\n",
    "preview": "posts/2020-02-15-demonstration/index_files/figure-html5/prev-1.png",
    "last_modified": "2021-03-09T13:57:04+01:00",
    "input_file": {},
    "preview_width": 1248,
    "preview_height": 768
  },
  {
    "path": "posts/2021-01-09-blenderschoolopenmovie2019/",
    "title": "Blender3d School Open Movie",
    "description": "WalnOt, a shortfilm made with blender in 2 weeks.",
    "author": [],
    "date": "2019-01-10",
    "categories": [
      "blender",
      "project"
    ],
    "contents": "\n\nAt the end of the Summer 2019 we got together as a group that met at the blender3d Summer School, a yearly event with blender workshops, to produce a short movie within 2 weeks. This is the result:\n\n\nYou can learn more about it on the project website. I was very lucky to work with such talented and inspirational people and am proud of what we achieved in such a small amount of time. Prior to this it had been quite a while since I had last worked with blender, but I kept up to date with the development as it is one of my favorite Open Source projects and a testament to the power of an open community and passionate developers.\n\n\n\n",
    "preview": "posts/2021-01-09-blenderschoolopenmovie2019/images/walnot.png",
    "last_modified": "2021-03-14T14:27:34+01:00",
    "input_file": {},
    "preview_width": 1282,
    "preview_height": 380
  },
  {
    "path": "posts/2020-10-26-12-the-father/",
    "title": "The father",
    "description": "Theater project at the anglistic seminar.",
    "author": [],
    "date": "2018-11-27",
    "categories": [
      "theater",
      "project"
    ],
    "contents": "\n\n\n\nTeaser\nThe Father (by Florian Zeller) tells the story of a father-daughter relationship, put under strain by the increasing dementia of the father. The story is told from the perspective of the father, André, and allows the audience to see the world through his perspective - with all the disjunctures, confusion and distress that dementia causes.\nThe production is co-directed by Dennis Massmann and Timothy Williams (previously ‘Twelve Angry Men’) and integrates this modern dramatic farce with elements of physical theatre to transport the audience into the mind of André.\nWhile the play is mildly disturbing, it is an important cultural contribution and allows the audience to see the world through the eyes of someone suffering from dementia.\nYou can by ticketes online!\n\n\n\n",
    "preview": "posts/2020-10-26-12-the-father/father.jpg",
    "last_modified": "2021-01-09T14:54:02+01:00",
    "input_file": {}
  },
  {
    "path": "posts/2020-10-26-12-angry-men/",
    "title": "12 Angry Men",
    "description": "Theater project at the anglistic seminar.",
    "author": [],
    "date": "2018-05-01",
    "categories": [
      "theater",
      "project"
    ],
    "contents": "\n\n\n\nTeaser\nA young man is accused of having killed his father, the evidence points in this direction, the witnesses corroborate the story against him. His fate rests in the hand of a jury - twelve men and women to decide if he should be executed. Eleven jurors are certain he is the murderer, but for one some questions remain open. This Anglistic Seminar performance approaches a modern classic from a fresh perspective, drawing the audience into the moral conundrum.\nsource\n\n\n\n",
    "preview": "posts/2020-10-26-12-angry-men/12am.jpg",
    "last_modified": "2021-01-09T14:54:06+01:00",
    "input_file": {}
  }
]
