[
  {
    "path": "teaching/dataintro20/",
    "title": "Introduction to data analysis with R (Online)",
    "description": "Heidelberg University, Biochemistry Bachelor and Master (WS 20/21)",
    "author": [
      {
        "name": "Jannik Buhr",
        "url": {}
      }
    ],
    "date": "2020-10-01",
    "categories": [],
    "contents": "\nGreetings Adventurers,\nAnd welcome to the next iteration of my introductory R course for data visualization and analysis. Because the concepts you will learn in this course will be most useful in areas where the working language is English, this course will also be in English. But feel free to ask questions in German as well any time. Let us start with the formalities.\nSign up\nIn order for us to stay connected during the course, please send me an email via my contact form and mention your name, as well as the course you are referring to (bachelor, master). I will not use your email address other than to contact you for the course.\nSchedule\nStarting November 2, 2020, I will upload a lecture video of about 1 hour every Monday (8 in total, the last one is going to be shorter due to Christmas). Corresponding exercises will be discussed during virtual Office Hours via a video conferencing tool the following Friday at 10:00 (the first is on Nov 6). The exercises are not graded, but in order for me to confirm your attendance I ask you to send in at least 6 of the 8 exercises prior to the Office Hour. This also allows me to better answer your questions during the course. Speaking of questions, I will also set up a messaging platform (discord) for you to discuss and ask questions outside of the Office Hours. You will get a confirmation mail with further details.\nPreparation and material\nFor the course we will use R inside of Rstudio, you can download them here:\nDownload R\nDownload RStudio\nThe course material and exercise solutions will get their own little website in due time and the link will also be found here:\ndataIntro20 website\n\n\n\n",
    "preview": "teaching/dataintro20/hex.png",
    "last_modified": "2020-10-29T21:32:25+01:00",
    "input_file": {},
    "preview_width": 720,
    "preview_height": 719
  },
  {
    "path": "teaching/dataintro19/",
    "title": "Introduction to data analysis with R",
    "description": "Heidelberg University, Biochemistry Bachelor and Master (WS 19/20)",
    "author": [
      {
        "name": "Jannik Buhr",
        "url": {}
      }
    ],
    "date": "2019-10-01",
    "categories": [],
    "contents": "\nThis course is available in English (master students) and German (bachelor students).\n\n\n\n",
    "preview": {},
    "last_modified": "2020-10-29T21:31:56+01:00",
    "input_file": {}
  }
]
